CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Customer/UpdateCustomerProfile/Request/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/types/" xmlns:cus="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/" xmlns:cus1="http://xmlns.oracle.com/apps/financials/receivables/customerSetup/customerProfiles/model/flex/CustomerProfileDff/" xmlns:cus2="http://xmlns.oracle.com/apps/financials/receivables/customerSetup/customerProfiles/model/flex/CustomerProfileGdf/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:updateCustomerProfile>
			<typ:customerProfile>
				<cus:AccountNumber>Testing_Account</cus:AccountNumber>
				<cus:SiteNumber>Test1002</cus:SiteNumber>
				<cus:CustomerAccountId>300000003167502</cus:CustomerAccountId>
				<cus:ClearingDays>30</cus:ClearingDays>
				<cus:PartyId>300000003167493</cus:PartyId>
				<cus:Tolerance>80</cus:Tolerance>
				<cus:CollectorName>Default Collector</cus:CollectorName>
            <cus:PaymentTerms>90 Days</cus:PaymentTerms>
         </typ:customerProfile>
      </typ:updateCustomerProfile>
   </soapenv:Body>
</soapenv:Envelope>